Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.networking.preference.custom
source: Custom Relays
ar: المرحلات المخصصة
de: Benutzerdefinierte Relais
es: Relés personalizados
fr: Relais personnalisés
ja: カスタムリレー
ko: 맞춤형 릴레이
zh_hans: 自定义中继
zh_hant: 客製化繼電器

# settings.networking.preference.managed
source: Selected cmux Relays
ar: مرحلات cmux المحددة
de: Ausgewählte cmux-Relays
es: Relés cmux seleccionados
fr: Relais cmux sélectionnés
ja: 選択した cmux リレー
ko: 선택된 cmux 릴레이
zh_hans: 选定的 cmux 中继
zh_hant: 選定的 cmux 繼電器

# settings.networking.private.add
source: Add Private Network
ar: إضافة شبكة خاصة
de: Privates Netzwerk hinzufügen
es: Agregar red privada
fr: Ajouter un réseau privé
ja: プライベートネットワークを追加
ko: 개인 네트워크 추가
zh_hans: 添加专用网络
zh_hant: 新增專用網絡

# settings.networking.private.add.short
source: Add…
ar: إضافة…
de: Hinzufügen…
es: Agregar…
fr: Ajouter…
ja: 追加…
ko: 추가…
zh_hans: 添加…
zh_hant: 新增…

# settings.networking.private.automatic
source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 自動

# settings.networking.private.edit
source: Edit Private Network
ar: تحرير الشبكة الخاصة
de: Privates Netzwerk bearbeiten
es: Editar red privada
fr: Modifier le réseau privé
ja: プライベートネットワークを編集
ko: 개인 네트워크 편집
zh_hans: 编辑专用网络
zh_hant: 編輯專用網絡

# settings.networking.private.enabled
source: Enabled
ar: ممكّن
de: Ermöglicht
es: Activado
fr: Activé
ja: 有効
ko: 활성화됨
zh_hans: 已启用
zh_hant: 啟用

# settings.networking.private.host
source: Host or IP Address
ar: المضيف أو عنوان IP
de: Host oder IP-Adresse
es: Host o dirección IP
fr: Hôte ou adresse IP
ja: ホストまたは IP アドレス
ko: 호스트 또는 IP 주소
zh_hans: 主机或 IP 地址
zh_hant: 主機或 IP 位址

# settings.networking.private.name
source: Name
ar: اسم
es: Nombre
fr: Nom
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 姓名

# settings.networking.private.note
source: Use this for Tailscale alternatives, a company VPN, or a private network you operate. Authentication still happens before cmux accepts the route.
ar: استخدم هذا لبدائل Tailscale، أو شبكة VPN للشركة، أو شبكة خاصة تقوم بتشغيلها. لا تزال المصادقة تحدث قبل أن يقبل cmux المسار.
de: Verwenden Sie dies für Tailscale-Alternativen, ein Firmen-VPN oder ein von Ihnen betriebenes privates Netzwerk. Die Authentifizierung erfolgt weiterhin, bevor cmux die Route akzeptiert.
es: Usa esto para alternativas a Tailscale, una VPN de la empresa o una red privada que operes. La autenticación sigue ocurriendo antes de que cmux acepte la ruta.
fr: Utilisez ceci pour les alternatives à Tailscale, un VPN d’entreprise ou un réseau privé que vous gérez. L’authentification a toujours lieu avant que cmux n'accepte la route.
ja: Tailscale の代替、会社の VPN、または自分で運用するプライベートネットワークに使用します。cmux がルートを受け入れる前に認証が行われます。
ko: Tailscale 대체 서비스, 회사 VPN 또는 직접 운영하는 사설 네트워크에 사용하세요. cmux가 경로를 수락하기 전에 인증이 먼저 수행됩니다.
zh_hans: 适用于 Tailscale 的替代方案、公司 VPN 或自行运营的专用网络。cmux 接受该路由之前仍会先完成认证。
zh_hant: 可用於 Tailscale 替代方案、公司 VPN 或您自行營運的私人網路。在 cmux 接受該路由之前，仍會進行身分驗證。

# settings.networking.private.note.short
source: The other Mac must run a current cmux build that advertises Iroh private-path support. Custom raw TCP routes are not accepted because they cannot prove the remote Mac. Iroh private paths stay encrypted and bound to its exact EndpointID.
ar: يجب أن يقوم جهاز Mac الآخر بتشغيل بنية cmux الحالية التي تعلن عن دعم مسار Iroh الخاص. لا يتم قبول مسارات TCP الخام المخصصة لأنها لا يمكنها إثبات جهاز Mac البعيد. تظل مسارات Iroh الخاصة مشفرة ومرتبطة بمعرف EndpointID الخاص بها تمامًا.
de: Der andere Mac muss einen aktuellen cmux-Build ausführen, der Iroh-Unterstützung für private Pfade ankündigt. Benutzerdefinierte rohe TCP-Routen werden nicht akzeptiert, da sie den entfernten Mac nicht nachweisen können. Private Iroh-Pfade bleiben verschlüsselt und an ihre genaue EndpointID gebunden.
es: La otra Mac debe ejecutar una compilación actual de cmux que anuncie soporte para rutas privadas de Iroh. No se aceptan rutas TCP directas personalizadas porque no pueden probar la Mac remota. Las rutas privadas de Iroh permanecen cifradas y vinculadas a su EndpointID exacto.
fr: L’autre Mac doit exécuter un build actuel de cmux qui annonce la prise en charge des chemins privés Iroh. Les routes TCP brutes personnalisées ne sont pas acceptées car elles ne peuvent pas prouver le Mac distant. Les chemins privés Iroh restent chiffrés et liés à leur EndpointID exact.
ja: 接続先のMacは、Irohのプライベート経路サポートを通知する最新のcmuxを実行している必要があります。カスタムの生 TCP ルートはリモート Mac を証明できないため受け付けません。Iroh のプライベート経路は暗号化され、正確な EndpointID に結び付けられます。
ko: 상대 Mac은 Iroh 사설 경로 지원을 제공하는 최신 cmux 빌드를 실행해야 합니다. 사용자 정의 원시 TCP 경로는 원격 Mac을 검증할 수 없으므로 수락되지 않습니다. Iroh 사설 경로는 암호화된 상태로 유지되며 정확한 EndpointID에 바인딩됩니다.
zh_hans: 对方 Mac 必须运行声明支持 Iroh 私有路径的较新 cmux 构建。自定义的裸 TCP 路由不被接受，因为它们无法证明远端 Mac 的身份。Iroh 私有路径始终加密，并绑定到其确切的 EndpointID。
zh_hant: 另一部 Mac 必須執行支援 Iroh 私人路徑宣告的最新 cmux 版本。不接受自訂原始 TCP 路由，因為其無法證明遠端 Mac 的身分。Iroh 私人路徑會保持加密，並繫結至其確切的 EndpointID。

# settings.networking.private.port
source: Port
ar: ميناء
de: Hafen
es: Puerto
ja: ポート
ko: 포트
zh_hans: 端口
zh_hant: 港口

# settings.networking.private.provider
source: Provider
ar: مزود
de: Anbieter
es: Proveedor
fr: Fournisseur
ja: プロバイダー
ko: 공급자
zh_hans: 提供方
zh_hant: 提供者

# settings.networking.private.remove.confirm
source: Remove this private network?
ar: هل تريد إزالة هذه الشبكة الخاصة؟
de: Dieses private Netzwerk entfernen?
es: ¿Eliminar esta red privada?
fr: Supprimer ce réseau privé ?
ja: このプライベートネットワークを削除しますか？
ko: 이 비공개 네트워크를 삭제하시겠습니까?
zh_hans: 确定要移除此专用网络吗？
zh_hant: 刪除這個專用網路嗎？

# settings.networking.private.subtitle
source: Iroh discovers usable LAN and VPN paths after authenticating the other device.
ar: يكتشف Iroh مسارات LAN وVPN القابلة للاستخدام بعد مصادقة الجهاز الآخر.
de: Iroh erkennt nutzbare LAN- und VPN-Pfade nach der Authentifizierung des anderen Geräts.
es: Iroh descubre rutas LAN y VPN utilizables después de autenticar el otro dispositivo.
fr: Iroh découvre les chemins LAN et VPN utilisables après avoir authentifié l’autre appareil.
ja: Iroh は相手デバイスを認証した後、利用可能な LAN および VPN 経路を検出します。
ko: Iroh는 상대 기기를 인증한 후 사용 가능한 LAN 및 VPN 경로를 발견합니다.
zh_hans: Iroh 会在认证对方设备后发现可用的局域网和 VPN 路径。
zh_hant: Iroh 會在驗證另一部裝置後，尋找可用的區域網路 (LAN) 與 VPN 路徑。

# settings.networking.private.tailscale
source: Tailscale Compatibility
ar: التوافق الذيل
de: Tailscale-Kompatibilität
es: Compatibilidad con escala trasera
fr: Compatibilité avec la balance arrière
ja: Tailscale 互換
ko: 테일스케일 호환성
zh_hans: Tailscale 兼容
zh_hant: 尾鱗相容性

# settings.networking.private.tailscale.subtitle
source: Retained for released clients and networks where Iroh cannot connect.
ar: مخصص للعملاء الذين تم إصدارهم والشبكات التي لا يمكن لـ Iroh الاتصال بها.
de: Beibehalten für freigegebene Clients und Netzwerke, bei denen Iroh keine Verbindung herstellen kann.
es: Retenido para clientes publicados y redes donde Iroh no se puede conectar.
fr: Conservé pour les clients privés et les réseaux où Iroh ne peut pas se connecter.
ja: リリース済みクライアントと Iroh が接続できないネットワーク向けに維持されます。
ko: 출시된 클라이언트 및 Iroh가 연결할 수 없는 네트워크를 위해 유지됩니다.
zh_hans: 为已发布的客户端以及 Iroh 无法连接的网络保留。
zh_hant: 為已發行的用戶端以及 Iroh 無法連線的網路所保留。

# settings.networking.private.title
source: Private Networks
ar: الشبكات الخاصة
de: Private Netzwerke
es: Redes Privadas
fr: Réseaux privés
ja: プライベートネットワーク
ko: 개인 네트워크
zh_hans: 专用网络
zh_hant: 專用網路

# settings.networking.refresh
source: Refresh
ar: تحديث
de: Aktualisieren
es: Refrescar
fr: Rafraîchir
ja: 更新
ko: 새로 고치다
zh_hans: 刷新
zh_hant: 重新整理

# settings.networking.relayOnly
source: Relay Only
ar: التتابع فقط
de: Nur Relais
es: Sólo relé
fr: Relais uniquement
ja: リレーのみ
ko: 릴레이 전용
zh_hans: 仅中继
zh_hant: 僅中繼

# settings.networking.relayOnly.subtitle
source: Keeps Iroh connections to this Mac on cmux relays instead of direct or local-network paths. Applies on the next reconnect.
ar: يبقي اتصالات Iroh بجهاز Mac هذا على مرحلات cmux بدلاً من المسارات المباشرة أو شبكة الاتصال المحلية. يتم تطبيقه عند إعادة الاتصال التالية.
de: Hält Iroh-Verbindungen zu diesem Mac auf cmux-Relays anstatt auf direkten oder lokalen Netzwerkpfaden. Wird beim nächsten Wiederverbinden angewendet.
es: Mantiene las conexiones de Iroh a esta Mac en retransmisiones de cmux en lugar de rutas directas o de red local. Se aplica en la siguiente reconexión.
fr: Maintient les connexions Iroh à ce Mac sur les relais cmux au lieu de chemins directs ou de réseau local. S'applique lors de la prochaine reconnexion.
ja: この Mac への Iroh 接続を、直接経路やローカルネットワーク経路ではなく cmux リレー経由に固定します。次回の再接続時に適用されます。
ko: 이 Mac에 대한 Iroh 연결을 직접 또는 로컬 네트워크 경로 대신 cmux 릴레이로 유지합니다. 다음 재연결 시 적용됩니다.
zh_hans: 让到此 Mac 的 Iroh 连接走 cmux 中继，而不是直连或局域网路径。在下次重连时生效。
zh_hant: 將連線至此 Mac 的 Iroh 連線保持在 cmux 中繼上，而非使用直接或本機網路路徑。於下一次重新連線時套用。

# settings.networking.relayPolicy.note
source: cmux downloads a signed relay catalog. Fleet additions, removals, and regional changes do not require an app update.
ar: يقوم cmux بتنزيل كتالوج مرحلات موقع. لا تتطلب إضافات الأسطول وإزالته والتغييرات الإقليمية تحديث التطبيق.
de: cmux lädt einen signierten Relay-Katalog herunter. Flottenhinzufügungen, -entfernungen und regionale Änderungen erfordern kein App-Update.
es: cmux descarga un catálogo de retransmisión firmado. Las adiciones, eliminaciones y cambios regionales de la flota no requieren una actualización de la aplicación.
fr: cmux télécharge un catalogue de relais signé. Les ajouts, suppressions et modifications régionales de la flotte ne nécessitent pas de mise à jour de l'application.
ja: cmux は署名済みリレーカタログを取得します。フリートの追加、削除、リージョン変更にアプリ更新は不要です。
ko: cmux는 서명된 릴레이 카탈로그를 다운로드합니다. 플릿 추가, 제거 및 지역 변경 시 앱 업데이트가 필요하지 않습니다.
zh_hans: cmux 会下载经过签名的中继目录。中继集群的增删和区域变更无需更新应用。
zh_hant: cmux 會下載已簽署的中繼型錄。群組新增、移除和區域變更皆不需要更新應用程式。

# settings.networking.relayPreference
source: Relay Preference
ar: تفضيل التتابع
de: Relaispräferenz
es: Preferencia de retransmisión
fr: Préférence de relais
ja: リレー設定
ko: 릴레이 기본 설정
zh_hans: 中继偏好
zh_hant: 中繼偏好

# settings.networking.relayPreference.subtitle
source: Direct peer-to-peer stays enabled. This controls which relays Iroh may use when a direct path is unavailable.
ar: يظل الاتصال المباشر بين النظراء (peer-to-peer) ممكناً. يتحكم هذا في المرحلات التي قد يستخدمها Iroh عندما يكون المسار المباشر غير متاح.
de: Direktes Peer-to-Peer bleibt aktiviert. Dies steuert, welche Relays Iroh verwenden darf, wenn kein direkter Pfad verfügbar ist.
es: La conexión directa entre pares permanece activada. Esto controla qué retransmisiones puede usar Iroh cuando una ruta directa no está disponible.
fr: Le peer-to-peer direct reste activé. Cela contrôle les relais qu'Iroh peut utiliser lorsqu'un chemin direct n'est pas disponible.
ja: ピアツーピアの直接接続は有効なままです。直接経路が利用できない場合に Iroh が使用できるリレーを指定します。
ko: 직접 피어 투 피어(P2P)는 활성화된 상태를 유지합니다. 이는 직접 경로를 사용할 수 없을 때 Iroh가 사용할 수 있는 릴레이를 제어합니다.
zh_hans: 点对点直连始终启用。此项控制在没有直连路径时 Iroh 可以使用哪些中继。
zh_hant: 直接點對點（peer-to-peer）連線仍維持啟用。此選項控制當直接路徑不可用時，Iroh 可使用的中繼。

# settings.networking.saveFailed
source: Could Not Save Networking Settings
ar: لا يمكن حفظ إعدادات الشبكة
de: Die Netzwerkeinstellungen konnten nicht gespeichert werden
es: No se pudo guardar la configuración de red
fr: Impossible d'enregistrer les paramètres réseau
ja: ネットワーク設定を保存できませんでした
ko: 네트워킹 설정을 저장할 수 없습니다.
zh_hans: 无法保存网络设置
zh_hant: 無法儲存網路設定

# settings.networking.saveFailed.message
source: Your previous networking configuration is still active. Check your account connection and relay values, then try again.
ar: لا يزال تكوين الشبكة السابق نشطًا. تحقق من اتصال حسابك وقيم المرحلات، ثم حاول مجددًا.
de: Ihre vorherige Netzwerkkonfiguration ist immer noch aktiv. Überprüfen Sie Ihre Kontoverbindung und Relay-Werte und versuchen Sie es erneut.
es: Tu configuración de red anterior sigue activa. Comprueba la conexión de tu cuenta y los valores de retransmisión, y luego vuelve a intentarlo.
fr: Votre configuration réseau précédente est toujours active. Vérifiez la connexion de votre compte et les valeurs des relais, puis réessayez.
ja: 以前のネットワーク設定が引き続き有効です。アカウント接続とリレーの値を確認して、もう一度お試しください。
ko: 이전 네트워크 구성이 여전히 활성화되어 있습니다. 계정 연결 및 릴레이 값을 확인한 다음 다시 시도하세요.
zh_hans: 此前的网络配置仍在生效。请检查账户连接和中继值，然后重试。
zh_hant: 您先前的網路組態仍處於啟用狀態。請檢查您的帳戶連線與中繼值，然後再試一次。

# settings.networking.status
source: Iroh Status
ar: حالة Iroh
es: Estado de Iroh
fr: Statut d'Iroh
ja: Iroh の状態
ko: Iroh 상태
zh_hans: Iroh 状态
zh_hant: Iroh 狀態

# settings.networking.status.active
source: Iroh endpoint active
ar: نقطة نهاية Iroh نشطة
de: Iroh-Endpunkt aktiv
es: Punto final de Iroh activo
fr: Point de terminaison Iroh actif
ja: Iroh エンドポイントは稼働中
ko: Iroh 엔드포인트 활성
zh_hans: Iroh 端点已激活
zh_hant: Iroh 端點活躍

# settings.networking.status.degraded
source: Direct-only until relay settings recover
ar: اتصال مباشر فقط حتى تتعافى إعدادات الترحيل
de: Nur direkt, bis sich die Relay-Einstellungen erholt haben
es: Solo directa hasta que se recuperen los ajustes de retransmisión
fr: Direct uniquement jusqu'à la récupération des paramètres de relais
ja: リレー設定が復旧するまで直接接続のみ
ko: 릴레이 설정이 복구될 때까지 직접 연결만 허용
zh_hans: 中继设置恢复前仅使用直连
zh_hant: 在中繼設定恢復前，僅限直接連線

# settings.networking.status.direct
source: Connected directly peer-to-peer
ar: متصل مباشرة بين النظراء (peer-to-peer)
de: Direkt über Peer-to-Peer verbunden
es: Conectado directamente de punto a punto
fr: Connecté directement en peer-to-peer
ja: ピアツーピアで直接接続
ko: 피어 투 피어로 직접 연결됨
zh_hans: 已点对点直接连接
zh_hant: 已透過點對點直接連線

# settings.networking.status.inactive
source: Inactive
ar: غير نشط
de: Inaktiv
es: Inactivo
fr: Inactif
ja: 停止中
ko: 비활성
zh_hans: 未激活
zh_hant: 非作用中

# settings.networking.status.private
source: Connected through %@
ar: متصل عبر %@
de: Verbunden über %@
es: Conectado a través de %@
fr: Connecté via %@
ja: %@ 経由で接続
ko: %@을(를) 통해 연결됨
zh_hans: 已通过 %@ 连接
zh_hant: 已透過 %@ 連線

# settings.networking.status.private.generic
source: Connected through a private network
ar: متصل عبر شبكة خاصة
de: Über ein privates Netzwerk verbunden
es: Conectado a través de una red privada
fr: Connecté via un réseau privé
ja: プライベートネットワーク経由で接続
ko: 사설 네트워크를 통해 연결됨
zh_hans: 已通过专用网络连接
zh_hant: 已透過私人網路連線

# settings.networking.status.relayed
source: Connected through %1$@, %2$@
ar: متصل عبر %1$@، و%2$@
de: Verbunden über %1$@, %2$@
es: Conectado a través de %1$@, %2$@
fr: Connecté via %1$@, %2$@
ja: %1$@（%2$@）経由で接続
ko: %1$@, %2$@을(를) 통해 연결됨
zh_hans: 已通过 %1$@ 连接，%2$@
zh_hant: 已透過 %1$@、%2$@ 連線

# settings.networking.status.starting
source: Starting
ar: البدء
de: Beginnt
es: A partir de
fr: Départ
ja: 起動中
ko: 시작
zh_hans: 正在启动
zh_hant: 開始

# settings.networking.test
source: Test
ar: امتحان
de: Prüfen
es: Prueba
fr: Tester
ja: テスト
ko: 시험
zh_hans: 测试
zh_hant: 測試

# settings.networking.test.failed
source: unreachable
ar: لا يمكن الوصول إليه
de: nicht erreichbar
es: no accesible
fr: inaccessible
ja: 到達不可
ko: 연결 불가
zh_hans: 无法访问
zh_hant: 無法連線

# settings.networking.test.incomplete
source: test unavailable
ar: الاختبار غير متاح
de: Test nicht verfügbar
es: prueba no disponible
fr: test indisponible
ja: テスト利用不可
ko: 테스트 불가
zh_hans: 测试不可用
zh_hant: 無法進行測試

# settings.networking.test.reachable
source: reachable
ar: يمكن الوصول إليه
de: erreichbar
es: accesible
fr: accessible
ja: 到達可能
ko: 연결 가능
zh_hans: 可访问
zh_hant: 可連線

# settings.notifications.agentIdleReminder.subtitle
source: Notify when an agent has been idle waiting for your input. Suppressed while background work is still running.
ar: إعلامي عندما يكون الوكيل خاملاً في انتظار إدخالك. يتم كتمه أثناء استمرار تشغيل العمل في الخلفية.
de: Benachrichtigen, wenn ein Agent im Leerlauf ist und auf Ihre Eingabe wartet. Unterdrückt, während noch Hintergrundarbeit läuft.
es: Notificar cuando un agente haya estado inactivo esperando tu respuesta. Se silencia mientras el trabajo en segundo plano sigue ejecutándose.
fr: Notifier lorsqu'un agent est resté inactif en attente de votre saisie. Désactivé tant que le travail en arrière-plan est toujours en cours d'exécution.
ja: エージェントがあなたの入力を待って待機しているときに通知します。バックグラウンド作業の実行中は抑制されます。
ko: 에이전트가 사용자의 입력을 기다리며 유휴 상태일 때 알립니다. 백그라운드 작업이 실행 중일 때는 억제됩니다.
uk: Сповіщати, коли агент неактивний і очікує вашого вводу. Придушується, доки виконується фонова робота.
zh_hans: 当代理空闲等待你输入时通知。后台工作仍在运行时不通知。
zh_hant: 當代理程式因等待您的輸入而閒置時發出通知。若背景工作仍在執行中，則會隱藏此通知。

# settings.notifications.agentIdleReminder.title
source: Agent Waiting for Input
ar: الوكيل ينتظر الإدخال
de: Agent wartet auf Eingabe
es: Agente esperando respuesta
fr: Agent en attente de saisie
ja: エージェントが入力待ち
ko: 에이전트 입력 대기 중
uk: Агент очікує вводу
zh_hans: 代理等待输入
zh_hant: 代理程式正在等待輸入

# settings.notifications.agentPermissionPrompt.subtitle
source: Notify when an agent is blocked waiting for your permission to run a tool.
ar: إعلامي عندما يكون الوكيل محجوبًا بانتظار إذنك لتشغيل أداة.
de: Benachrichtigen, wenn ein Agent blockiert ist und auf Ihre Erlaubnis zum Ausführen eines Werkzeugs wartet.
es: Notificar cuando un agente esté bloqueado esperando tu permiso para ejecutar una herramienta.
fr: Notifier lorsqu'un agent est bloqué en attente de votre autorisation pour exécuter un outil.
ja: エージェントがツールの実行にあなたの許可を待って停止しているときに通知します。
ko: 에이전트가 도구 실행에 대한 사용자의 허가를 기다리며 멈췄을 때 알립니다.
uk: Сповіщати, коли агент заблоковано в очікуванні вашого дозволу на запуск інструмента.
zh_hans: 当代理因等待你授权运行工具而阻塞时通知。
zh_hant: 當代理程式因等待您允許執行工具而受阻時發出通知。

# settings.notifications.agentPermissionPrompt.title
source: Agent Needs Permission
ar: الوكيل يحتاج إلى إذن
de: Agent benötigt Erlaubnis
es: El agente necesita permiso
fr: L'agent a besoin d'une autorisation
ja: エージェントが許可待ち
ko: 에이전트 권한 필요
uk: Агент очікує дозволу
zh_hans: 代理需要权限
zh_hant: 代理程式需要權限

# settings.notifications.agentTurnComplete.option.always
source: Always
ar: دائماً
de: Stets
es: Siempre
fr: Toujours
ja: 常に
ko: 항상
uk: Завжди
zh_hans: 始终
zh_hant: 總是

# settings.notifications.agentTurnComplete.option.never
source: Never
ar: أبدًا
de: Nie
es: Nunca
fr: Jamais
ja: しない
ko: 안 함
uk: Ніколи
zh_hans: 从不
zh_hant: 永不

# settings.notifications.agentTurnComplete.option.whenIdle
source: When idle
ar: عند الخمول
de: Bei Inaktivität
es: Cuando esté inactivo
fr: En cas d'inactivité
ja: 待機中
ko: 유휴 시
uk: Коли неактивний
zh_hans: 空闲时
zh_hant: 閒置時

# settings.notifications.agentTurnComplete.subtitle
source: When to notify that an agent finished. When idle waits until background tasks and scheduled wakeups drain.
ar: متى يتم الإخطار بانتهاء الوكيل. ينتظر خيار "عند الخمول" حتى تنتهي المهام في الخلفية وتنبيهات الاستيقاظ المجدولة.
de: Wann benachrichtigt werden soll, dass ein Agent fertig ist. „Bei Inaktivität“ wartet, bis Hintergrundaufgaben und geplante Reaktivierungen abgeschlossen sind.
es: Cuándo notificar que un agente ha terminado. La opción "cuando esté inactivo" espera hasta que finalicen las tareas en segundo plano y las reactivaciones programadas.
fr: Quand notifier qu'un agent a terminé. « En cas d'inactivité » attend que les tâches en arrière-plan et les réveils programmés se terminent.
ja: エージェントが完了したときに通知するタイミング。待機中はバックグラウンドタスクとスケジュール再開が片付くまで待ちます。
ko: 에이전트가 완료되었을 때 알릴 시점입니다. 유휴 시에는 백그라운드 작업과 예약된 재개가 끝날 때까지 기다립니다.
uk: Коли сповіщати про завершення роботи агента. У режимі очікування чекає, доки завершаться фонові задачі та заплановані пробудження.
zh_hans: 何时通知代理已完成。「空闲时」会等到后台任务和计划唤醒都清空之后。
zh_hant: 何時通知代理程式已結束。選擇「閒置時」會等待背景任務及排程喚醒全部清空。

# settings.notifications.agentTurnComplete.title
source: Agent Finished
ar: انتهى الوكيل
de: Agent fertiggestellt
es: Agente finalizado
fr: Agent terminé
ja: エージェントが完了
ko: 에이전트 완료
uk: Агент завершив
zh_hans: 代理已完成
zh_hant: 代理程式已結束

# settings.notifications.command
source: Notification Command
ar: أمر الإشعار
de: Benachrichtigungsbefehl
es: Comando de notificación
fr: Commande de notification
ja: 通知コマンド
ko: 알림 명령
zh_hans: 通知命令
zh_hant: 通知指令

# settings.notifications.command.subtitle
source: Run a shell command when a notification arrives. $CMUX_NOTIFICATION_TITLE, $CMUX_NOTIFICATION_SUBTITLE, $CMUX_NOTIFICATION_BODY are set.
ar: قم بتشغيل أمر غلاف (shell) عند وصول إشعار. يتم تعيين $CMUX_NOTIFICATION_TITLE و $CMUX_NOTIFICATION_SUBTITLE و $CMUX_NOTIFICATION_BODY.
de: Einen Shell-Befehl ausführen, wenn eine Benachrichtigung eingeht. $CMUX_NOTIFICATION_TITLE, $CMUX_NOTIFICATION_SUBTITLE und $CMUX_NOTIFICATION_BODY sind gesetzt.
es: Ejecuta un comando de shell cuando llega una notificación. Se definen $CMUX_NOTIFICATION_TITLE, $CMUX_NOTIFICATION_SUBTITLE y $CMUX_NOTIFICATION_BODY.
fr: Exécuter une commande shell lorsqu'une notification arrive. $CMUX_NOTIFICATION_TITLE, $CMUX_NOTIFICATION_SUBTITLE, $CMUX_NOTIFICATION_BODY sont définis.
ja: 通知が届いたときにシェルコマンドを実行します。$CMUX_NOTIFICATION_TITLE、$CMUX_NOTIFICATION_SUBTITLE、$CMUX_NOTIFICATION_BODY が設定されます。
ko: 알림이 도착했을 때 쉘 명령을 실행합니다. $CMUX_NOTIFICATION_TITLE, $CMUX_NOTIFICATION_SUBTITLE, $CMUX_NOTIFICATION_BODY가 설정됩니다.
zh_hans: 通知到达时运行一条 shell 命令。会设置 $CMUX_NOTIFICATION_TITLE、$CMUX_NOTIFICATION_SUBTITLE、$CMUX_NOTIFICATION_BODY。
zh_hant: 當通知送達時執行 shell 指令。已設定 $CMUX_NOTIFICATION_TITLE、$CMUX_NOTIFICATION_SUBTITLE、$CMUX_NOTIFICATION_BODY 變數。

# settings.notifications.desktop
source: Desktop Notifications
ar: إشعارات سطح المكتب
bs: Obavještenja na radnoj površini
da: Skrivebordsnotifikationer
de: Desktop-Benachrichtigungen
es: Notificaciones de escritorio
fr: Notifications du bureau
it: Notifiche desktop
ja: デスクトップ通知
ko: 데스크톱 알림
nb: Skrivebordsvarsler
pl: Powiadomienia na pulpicie
pt_br: Notificações da área de trabalho
ru: Уведомления на рабочем столе
th: การแจ้งเตือนบนเดสก์ท็อป
tr: Masaüstü Bildirimleri
uk: Сповіщення на робочому столі
zh_hans: 桌面通知
zh_hant: 桌面通知

# settings.notifications.desktop.action.enable
source: Enable
ar: تمكين
bs: Omogući
da: Slå til
de: Aktivieren
es: Activar
fr: Activer
it: Abilita
ja: 有効にする
ko: 활성화
nb: Aktiver
pl: Włącz
pt_br: Ativar
ru: Включить
th: เปิดใช้งาน
tr: Etkinleştir
uk: Увімкнути
zh_hans: 启用
zh_hant: 啟用

# settings.notifications.desktop.action.openSettings
source: Open System Settings
ar: فتح إعدادات النظام
bs: Otvori Postavke sistema
da: Åbn Systemindstillinger
de: Systemeinstellungen öffnen
es: Abrir Ajustes del Sistema
fr: Ouvrir les Réglages Système
it: Apri Impostazioni di Sistema
ja: システム設定を開く
ko: 시스템 설정 열기
nb: Åpne Systeminnstillinger
pl: Otwórz Ustawienia systemowe
pt_br: Abrir Ajustes do Sistema
ru: Открыть Системные настройки
th: เปิดการตั้งค่าระบบ
tr: Sistem Ayarları'nı Aç
uk: Відкрити Системні налаштування
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

# settings.notifications.desktop.sendTest
source: Send Test
ar: إرسال اختبار
bs: Pošalji test
de: Test senden
es: Enviar prueba
fr: Envoyer un test
it: Invia test
ja: テストを送信
ko: 테스트 보내기
pl: Wyślij test
pt_br: Enviar teste
ru: Отправить тест
th: ส่งการทดสอบ
tr: Test Gönder
uk: Надіслати тест
zh_hans: 发送测试
zh_hant: 傳送測試

# settings.notifications.desktop.status.allowed
source: Allowed
ar: مسموح
bs: Dozvoljeno
da: Tilladt
de: Erlaubt
es: Permitidas
fr: Autorisées
it: Consentite
ja: 許可済み
ko: 허용됨
nb: Tillatt
pl: Dozwolone
pt_br: Permitidas
ru: Разрешено
th: อนุญาตแล้ว
tr: İzin Verildi
uk: Дозволено
zh_hans: 已允许
zh_hant: 已允許

# settings.notifications.desktop.status.deliverQuietly
source: Deliver Quietly
ar: التسليم بهدوء
bs: Dostavi tiho
da: Lever stille
de: Leise zustellen
es: Entregar silenciosamente
fr: Distribuer discrètement
it: Consegna in silenzio
ja: 静かに配信
ko: 조용히 전달
nb: Lever stille
pl: Dostarczaj po cichu
pt_br: Entregar silenciosamente
ru: Доставлять тихо
th: ส่งแบบเงียบ
tr: Sessiz Teslim Et
uk: Доставляти тихо
zh_hans: 静默送达
zh_hant: 靜默傳送

# settings.notifications.desktop.status.denied
source: Denied
ar: مرفوض
bs: Odbijeno
da: Afvist
de: Abgelehnt
es: Denegadas
fr: Refusées
it: Negate
ja: 拒否
ko: 거부됨
nb: Avvist
pl: Odmówiono
pt_br: Negadas
ru: Запрещено
th: ถูกปฏิเสธ
tr: Reddedildi
uk: Відхилено
zh_hans: 已拒绝
zh_hant: 已拒絕

# settings.notifications.desktop.status.temporary
source: Temporary
ar: مؤقت
bs: Privremeno
da: Midlertidig
de: Vorübergehend
es: Temporal
fr: Temporaire
it: Temporaneo
ja: 一時的
ko: 임시
nb: Midlertidig
pl: Tymczasowe
pt_br: Temporário
ru: Временно
th: ชั่วคราว
tr: Geçici
uk: Тимчасово
zh_hans: 临时
zh_hant: 暫時
